"""
    Я Функция, и я ищу все файлы конкретного типа внутри папки.
    Я не трогаю папки внутри папки в которой ищу.
    Если я смогла найти что-то, я возвращаю внутри массива.
    Если я не смогла найти что-то я возвращаю None
    Если были проблемы я возвращаю булево-значения.
    Я дополнительная функция.
"""


Я функция читаю масив и тип файла():  # Удаление чужих типов.
    удаляю адресса файлов чужих тип.
    Повторяю пока ИЗМЕНЯЮ СВОЕ МНЕНИЕ.:
        Я НЕ ИЗМЕНИЛ СВОЕ МНЕНИЕ.
        Читаю по строчно массив:
            Если элемент не заканчивает на нужный тип:
                удаляю элемент
                Я ИЗМЕНИЛ СВОЕ МНЕНИЕ.
    верну масив

def searh_typ(typ):
    Пробую получить список файлов:
        Список получен.
        список = форматирование типа.
        
        Озвучить  конечный список файлов
    Иначе:
        Скажу что не смог прочитать папку.
    Финал:
        Пробую закрыть папку, или удалить изначальный массив.
        Этот блок сдесь не обьязателен, но должен быть хотябы пустым.

