APD-3 - ANT Public Document - документация о встроенных моделях. Правила
написания данных отличающихся типом.

Модули должны отвечать на вопросы ответами: ДА, Нет, Незнаю, Не могу
ответить.

Встроенный модуль делает только одну конкретную задачу, какой бы она
малой не казалась! После выполнения модуль отдает вам отчет.
Настоятельно рекомендую Рассматривать некоторые PAT.

Есть несколько типов встроенных модулей:
1. Я делаю что-то, для того, что-бы после сказать получилось ли это
сделать. - Действие.
2. Я делаю что-то, для того, что-бы после отменить своё дествие и
сказать могу ли это сделать. - Проверка.

Могу я сделать это? - По осторожнее с этой  функцией (Не возможно все
отменить)

NoneType - Всегда должен означать что модуль выполнил основную задачу,
и притензий нет!

False - Всегда должен означать что модуль выполнил основную задачу, но
притензие есть!

True - Всегда должен означать что модуль не выполнил свою задачу!

Exception - Не предвиденная ситуация.

NoneType преоразовав в bool даст False, зная это учитывайте как проще
будет комбинировать ваши рузультаты.

NoneType - означает что задача выполнина, в других случаях же есть
нюансы.

